# Uso de Dataframe en Pandas
##### https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.html

In [ ]:
import pandas as pd
import sys
import datetime as dt
import numpy as np
import matplotlib.pyplot as plt
import matplotlib
from pandas.tools.plotting import radviz

%matplotlib inline

In [ ]:
mi_df = pd.read_excel('data/data-uno.xls')

In [5]:
data = {'ciudad': ['Loja', 'Pichincha', 'Guayas'],
        'capital' : ['Loja', 'Quito', 'Guayaquil'],
        'zona'  : [7, 8, 1]}
frame = pd.DataFrame(data) # Creando un DataFrame desde un diccionario
frame

     capital     ciudad  zona
0       Loja       Loja     7
1      Quito  Pichincha     8
2  Guayaquil     Guayas     1

In [6]:
columnas = ['nombres','apellidos','cedula']

In [7]:
lista = [['rene', 'elizalde', '11041260'],
        ['rolando', 'solano', '11041261'],]

In [8]:
data = pd.DataFrame(lista, columns=columnas)

In [9]:
data

   nombres apellidos    cedula
0     rene  elizalde  11041260
1  rolando    solano  11041261

In [10]:
lista2 = [['rene2', 'elizalde2', '11041263'],
        ['rolando2', 'solano2', '11041264'],]

In [11]:
data2 = pd.DataFrame(lista2, columns=columnas)

In [12]:
data2

    nombres  apellidos    cedula
0     rene2  elizalde2  11041263
1  rolando2    solano2  11041264

In [13]:
data3 = pd.concat([data, data2])

In [14]:
data3

    nombres  apellidos    cedula
0      rene   elizalde  11041260
1   rolando     solano  11041261
0     rene2  elizalde2  11041263
1  rolando2    solano2  11041264

In [15]:
data5 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263', '11041264'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito', 'Loja'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha', 'Loja']})

In [16]:
result = pd.merge(data3, data5, on='cedula')

In [17]:
result

    nombres  apellidos    cedula     Ciudad  Provincia
0      rene   elizalde  11041260  Guayaquil     Guayas
1   rolando     solano  11041261     Cuenca      Azuay
2     rene2  elizalde2  11041263      Quito  Pichincha
3  rolando2    solano2  11041264       Loja       Loja

In [18]:
data6 = pd.DataFrame({'cedula': ['11041260', '11041261', '11041263'],
 	'Ciudad': ['Guayaquil', 'Cuenca', 'Quito'],
	'Provincia': ['Guayas', 'Azuay', 'Pichincha']})
data6

      Ciudad  Provincia    cedula
0  Guayaquil     Guayas  11041260
1     Cuenca      Azuay  11041261
2      Quito  Pichincha  11041263